app/Controllers/Dosen.php

    public function index()
    {
        if (!session()->get('username')) {
            return redirect()->route('Login::index');
        }
        $data = [
            'data' => $this->dosen->paginate('5', 'dosen'),
            'title' => 'Data Dosen',
            'pager' => $this->dosen->pager,
        ];
---
SELECT *
FROM `dosen`
 LIMIT 2
SELECT COUNT(*) AS `numrows`
FROM `dosen`

    public function update($id)
    {
        $data = $this->request->getPost();
        if (!$this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->dosen->update($id, $data);
---
UPDATE `dosen` SET `kode_dosen` = 'DSN0001', `nama_dosen` = 'Bayu', `tgl_lahir` = '2024-05-13', `no_telp` = '982676381', `email` = 'abas@gmail.com', `alamat` = 'Saga', `status_dosen` = '0'
WHERE `dosen`.`id_dosen` IN ('1')