app/Controllers/Matkul.php

    public function index()
    {
        if (!session()->get('username')) {
            return redirect()->route('Login::index');
        }
        $data = [
            'data' => $this->matkul->join('dosen', 'dosen.id_dosen = matkul.id_dosen')
                ->paginate('5', 'matkul'),
            'title' => 'Data Mata Kuliah',
            'pager' => $this->matkul->pager,
        ];
---
SELECT *
FROM `matkul`
JOIN `dosen` ON `dosen`.`id_dosen` = `matkul`.`id_dosen`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `matkul`
JOIN `dosen` ON `dosen`.`id_dosen` = `matkul`.`id_dosen`

    public function edit($id)
    {
        $data = [
            'title' => 'Edit Data Mata Kuliah',
            'data' => $this->matkul->join('dosen', 'dosen.id_dosen = matkul.id_dosen')
                ->findAll(),
            'matkul' => $this->matkul->find($id),
            'dosen' => $this->dosen->findAll()
---
SELECT *
FROM `matkul`
JOIN `dosen` ON `dosen`.`id_dosen` = `matkul`.`id_dosen`
SELECT *
FROM `dosen`

    public function update($id)
    {
        $data = $this->request->getPost();
        if (!$this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->matkul->update($id, $data);
---
UPDATE `matkul` SET `nama_matkul` = 'Kalkulus', `sks` = '3'
WHERE `matkul`.`id_matkul` IN ('5')