app/Controllers/Petugas.php

SELECT *
FROM `petugas`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `petugas`.`id_jabatan`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `petugas`
JOIN `jabatan` ON `jabatan`.`id_jabatan` = `petugas`.`id_jabatan`
---
    public function index()
    {
        if (!session()->get('username')) {
            return redirect()->route('Login::index');
        }
        $data = [
            'data' => $this->petugas->join('jabatan', 'jabatan.id_jabatan = petugas.id_jabatan')
                ->paginate('5', 'petugas'),
            'title' => 'Data Petugas',
            'pager' => $this->petugas->pager,
        ];