app/Controllers/Users.php

SELECT *
FROM `users`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `users`
---
    public function index()
    {
        if (!session()->get('username')) {
            return redirect()->route('Login::index');
        }
        $data = [
            'data' => $this->users->paginate('5', 'Users'),
            'title' => 'Data Users',
            'pager' => $this->users->pager,
        ];

INSERT INTO `users` (`username`, `password`, `nama_user`) VALUES ('Bayu', '$2y$10$dm6ouqGBOmaeaExOUtwKzepsM0obdmI9fptJjeFI/mAhAKtKPlPQO', 'Bayu')
---
    public function save()
    {
        $data = [
            'username' => $this->request->getVar('username'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
            'nama_user' => $this->request->getVar('nama_user')
        ];
        if (!$this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->users->save($data);

UPDATE `users` SET `username` = 'Ubay', `password` = '$2y$10$BDYSYICpLj/I2iG46anWnOGjkeqBUqecoyOTQbUb8Z/8HTJnG9uNy', `nama_user` = 'Bayu'
WHERE `users`.`id_user` IN ('5')
---
    public function update($id)
    {
        $data = [
            'username' => $this->request->getVar('username'),
            'password' => password_hash($this->request->getVar('password'), PASSWORD_BCRYPT),
            'nama_user' => $this->request->getVar('nama_user')
        ];
        if (!$this->validateData($data, $this->rules)) {
            return redirect()->back()->with('message', $this->validator->getErrors());
        }

        $this->users->update($id, $data);